app/controllers/companies_controller.rb

INSERT INTO "companies" ("name", "color_index", "created_at", "updated_at", "owner_token") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "Aさんの企業"], ["color_index", 3], ["created_at", "2026-09-13 07:38:55.198502"], ["updated_at", "2026-09-13 07:38:55.198502"], ["owner_token", "[FILTERED]"]]
---
  def create
    company = Company.new(company_params.merge(owner_token: current_owner_token))
    if company.save

SELECT "companies".* FROM "companies" WHERE "companies"."owner_token" = ? AND "companies"."id" = ? LIMIT ?  [["owner_token", "[FILTERED]"], ["id", 10], ["LIMIT", 1]]
---
  def destroy
    company = Company.where(owner_token: current_owner_token).find(params[:id])