app/controllers/map_controller.rb

SELECT "companies".* FROM "companies" WHERE "companies"."owner_token" = ? ORDER BY "companies"."created_at" ASC  [["owner_token", "[FILTERED]"]]
---
  def show
    @companies = Company.where(owner_token: current_owner_token).order(:created_at)