app/controllers/points_controller.rb

INSERT INTO "points" ("company_id", "x", "y", "what", "info", "emotion", "meaning", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    company = owned_companies.find(point_params[:company_id])
    point = company.points.new(point_params.except(:company_id))
    if point.save

UPDATE "points" SET "what" = ?, "info" = ?, "emotion" = ?, "meaning" = ?, "updated_at" = ? WHERE "points"."id" = ?  [["what", "っっr"], ["info", "っっr"], ["emotion", "っっr"], ["meaning", "さfd"], ["updated_at", "2026-09-13 06:44:11.986306"], ["id", 21]]
---
  def update
    point = owned_points.find(params[:id])
    # company_id を変更する場合も、変更先が自分の企業であることを確認する
    owned_companies.find(point_params[:company_id]) if point_params[:company_id].present?
    if point.update(point_params)

DELETE FROM "points" WHERE "points"."id" = ?  [["id", 13]]
---
  def destroy
    point = owned_points.find(params[:id])
    point.destroy