app/models/company.rb

  def assign_color_index
    self.color_index = Company.count
---
SELECT COUNT(*) FROM "companies"